//Первое задание
//var a = 1, b = 1, c, d;
//c = ++a; alert(c);// 2
/*
Так как знак инкремента стоит до переменной а, то к её значению 1 прибавляем 1. Значение с=2
 */
//d = b++; alert(d);// 1
/*
Так как знак инкремента стоит после переменной b, то её значение увеличится на 1 после присвоения значения переменной d.
Соответственно, значение b=1 и зеначение d=1
 */
//c = (2+ ++a); alert(c);// 5
/*
Так как знак инкремента стоит до переменной а, то она увеличится на 1. Прошлое значение переменной а=2. 2+1=3. с=2+3=5
 */
//d = (2+ b++); alert(d);// 4
/*
Так как знак инкремента стоит после переменной b, её значение увеличится после присвоения значения переменной d.
На данном этапе значение переменной b=2. d=2+2=4
 */
//alert(a);// 3
/*
последнее значение переменной а было равно 3. Оно остаётся прежним, так как других действий с этой переменной не производилось.
 */
//alert(b);// 3
/*
Значение b увеличилось за счёт постинкремента и стало равно 3
 */

//Второе задание
/*var a = 2;var x = 1 + (a *= 2);
x=5*/

//Третье задание
/*let a=5;
let b=2;
if (a>=0 && b>=0){
    console.log(a-b);
}
else if(a<0 && b<0){
    console.log(a*b);
}
else if(a>=0 && b<0){
    console.log(a+b);
}
else if(a<0 && b>=0){
    console.log(a+b);
}*/

//Четвёртое задание
/*let a=11;
switch (a){
    case 0:
        console.log(0+'-'+1+'-'+2+'-'+3+'-'+4+'-'+5+'-'+6+'-'+7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 1:
        console.log(1+'-'+2+'-'+3+'-'+4+'-'+5+'-'+6+'-'+7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 2:
        console.log(2+'-'+3+'-'+4+'-'+5+'-'+6+'-'+7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 3:
        console.log(3+'-'+4+'-'+5+'-'+6+'-'+7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 4:
        console.log(4+'-'+5+'-'+6+'-'+7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 5:
        console.log(5+'-'+6+'-'+7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 6:
        console.log(6+'-'+7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 7:
        console.log(7+'-'+8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 8:
        console.log(8+'-'+9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 9:
        console.log(9+'-'+10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 10:
        console.log(10+'-'+11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 11:
        console.log(11+'-'+12+'-'+13+'-'+14+'-'+15);
        break;
    case 12:
        console.log(12+'-'+13+'-'+14+'-'+15);
        break;
    case 13:
        console.log(13+'-'+14+'-'+15);
        break;
    case 14:
        console.log(14+'-'+15);
        break;
    case 15:
        console.log(15);
        break;
    default:
        console.log('Error');
        break;
}*/

//Пятое задание

/*function sum(x,y){
    return(x+y)
}
avg = sum(5,3);
console.log(avg);

function difference(x,y){
    return(x-y)
}
avg = difference(5,3);
console.log(avg);

function multiplication(x,y){
    return(x*y)
}
avg = multiplication(5,3);
console.log(avg);

function division(x,y){
    return(x/y)
}
avg = division(5,3);
console.log(avg);*/